{
  "General": [
    "How do I create a new Azure subscription?",
    "What Azure services are available for hosting web applications?",
    "How can I set up network security groups to control traffic to my Azure resources?",
    "What options does Azure offer for identity and access management?",
    "How do I monitor the performance and health of my Azure resources?",
    "What are the best practices for implementing high availability in Azure?",
    "How can I integrate Azure services with on-premises infrastructure?",
    "What tools does Azure provide for data analytics and machine learning?",
    "How do I automate resource provisioning and management in Azure?",
    "What are the options for disaster recovery and backup in Azure?"
  ],
  "Create": [
    "Provision a virtual machine (VM) in Azure with specific configurations and operating system.",
    "Create a storage account in Azure to store files, blobs, and other data objects.",
    "Deploy a web app in Azure App Service with custom code or from a container image.",
    "Set up a SQL database in Azure to store relational data with scalability and built-in security.",
    "Create a virtual network (VNet) in Azure with subnets, network security groups, and routing rules.",
    "Deploy a Kubernetes cluster in Azure Kubernetes Service (AKS) for container orchestration.",
    "Set up an Azure Functions app to execute serverless code in response to events.",
    "Create a Cosmos DB instance in Azure for globally distributed NoSQL databases.",
    "Provision an Azure Active Directory (AD) tenant and configure user accounts and access policies.",
    "Set up an Azure DevOps project for continuous integration and delivery (CI/CD) pipelines."
  ],
  "Describe": [
    "Get details about a specific VM in Azure, including its size, operating system, and resource group.",
    "Describe the contents of a storage account in Azure, including blobs, files, and containers.",
    "Retrieve information about a web app deployed in Azure App Service, including its URL, deployment slots, and scaling settings.",
    "Get metadata about a SQL database in Azure, including its size, performance tiers, and backup schedule.",
    "Describe the networking configuration of a VNet in Azure, including subnets, virtual network peering, and firewall rules.",
    "Retrieve information about a Kubernetes cluster in AKS, including node count, version, and deployed workloads.",
    "Describe the settings and triggers configured for an Azure Functions app, including function code and bindings.",
    "Get details about a Cosmos DB instance in Azure, including its consistency level, throughput, and geographical replication.",
    "Describe the users and groups configured in an Azure AD tenant, including their roles and permissions.",
    "Retrieve information about Azure DevOps projects, including repositories, pipelines, and work items."
  ],
  "Update": [
    "Resize or change the configuration of an existing VM in Azure, such as increasing memory or adding additional disks.",
    "Update the access control settings of a storage account in Azure to grant or revoke permissions to specific users or applications.",
    "Modify the deployment settings of a web app in Azure App Service, such as updating the runtime stack or deployment slots.",
    "Adjust the performance tier or scaling settings of a SQL database in Azure to accommodate changes in workload.",
    "Update the networking configuration of a VNet in Azure, such as adding or removing subnets or updating routing rules.",
    "Modify the node count or scaling settings of a Kubernetes cluster in AKS to adjust capacity based on demand.",
    "Update the code or configuration of an Azure Functions app to add new functionality or improve performance.",
    "Adjust the throughput or consistency level settings of a Cosmos DB instance in Azure to optimize performance.",
    "Modify user accounts, groups, or access policies in an Azure AD tenant to reflect changes in organizational structure or requirements.",
    "Update the configuration of Azure DevOps projects, such as adding new repositories or modifying pipeline definitions."
  ],
  "List": [
    "List all VMs deployed in a specific Azure subscription along with their names, sizes, and resource groups.",
    "Retrieve a list of storage accounts in Azure along with their types, locations, and creation dates.",
    "List all web apps deployed in Azure App Service along with their URLs, runtime stacks, and deployment slots.",
    "Get a list of SQL databases in Azure along with their names, performance tiers, and backup status.",
    "List all VNets in Azure along with their names, address spaces, and associated subnets.",
    "Retrieve a list of Kubernetes clusters in AKS along with their names, versions, and node counts.",
    "List all Azure Functions apps along with their names, triggers, and function counts.",
    "Get a list of Cosmos DB instances in Azure along with their names, consistency levels, and throughput settings.",
    "List all users and groups in an Azure AD tenant along with their roles, memberships, and permissions.",
    "Retrieve a list of Azure DevOps projects along with their names, repositories, pipelines, and build statuses."
  ],
  "Delete": [
    "Delete a VM in Azure and remove all associated disks, network interfaces, and configurations.",
    "Remove a storage account in Azure and permanently delete all blobs, files, and containers stored within it.",
    "Delete a web app in Azure App Service and remove all associated deployment slots, configurations, and certificates.",
    "Remove a SQL database in Azure and permanently delete all data stored within it, along with associated backups and replicas.",
    "Delete a VNet in Azure and remove all associated subnets, peering connections, and network security groups.",
    "Remove a Kubernetes cluster in AKS and delete all deployed workloads, pods, and configurations.",
    "Delete an Azure Functions app and remove all associated function code, triggers, and bindings.",
    "Remove a Cosmos DB instance in Azure and permanently delete all data stored within it, along with associated backups and replicas.",
    "Delete user accounts or groups in an Azure AD tenant and remove all associated permissions and access policies.",
    "Delete an Azure DevOps project and remove all associated repositories, pipelines, and build artifacts."
  ]
}
