{
  "General": [
    "Check the CPU utilization of a specific EC2 instance.",
    "Retrieve the monthly cost breakdown of all resources in an AWS account.",
    "List all available instance types in the us-east-1 region.",
    "Describe the inbound and outbound rules of a security group attached to a production EC2 instance.",
    "Get the status of a specific billing alarm in CloudWatch.",
    "Find the latest version of the AWS SDK for Python (Boto3).",
    "List all ECS clusters running in the development environment.",
    "Retrieve the latest logs from a Lambda function processing user authentication requests.",
    "Describe the environment variables set for an Elastic Beanstalk application.",
    "Get the IAM policies attached to a group of IAM users in the finance department.",
    "List all available storage classes for Amazon S3 in the us-west-2 region.",
    "Describe the resources managed by a specific CloudFormation stack.",
    "Get the status of a recent deployment in AWS CodeDeploy.",
    "Retrieve information about the latest database snapshots in Amazon RDS.",
    "List all Lambda functions associated with an API Gateway REST API.",
    "Describe the configuration of an Auto Scaling group scaling policy.",
    "Get the status of a Network Load Balancer handling incoming traffic.",
    "Retrieve the list of recent API calls made by a specific IAM user.",
    "List all DynamoDB tables with provisioned capacity exceeding 80%.",
    "Describe the API Gateway deployment stages for the production environment."
  ],
  "Create": [
    "Launch a new EC2 instance with Ubuntu 20.04 LTS.",
    "Create an Amazon S3 bucket for storing user-uploaded images in a web application.",
    "Provision an Amazon RDS PostgreSQL database for a new microservices architecture.",
    "Deploy a new version of a Python-based Lambda function for processing data streams.",
    "Set up an Amazon API Gateway REST API to expose endpoints for a mobile app backend.",
    "Establish a new AWS Direct Connect connection to a data center for hybrid cloud connectivity.",
    "Create a new AWS CodePipeline pipeline for automating CI/CD workflows.",
    "Deploy a scalable Node.js application using AWS Elastic Beanstalk.",
    "Spin up an Amazon EMR cluster with Apache Spark for big data analytics.",
    "Create an AWS Glue crawler to catalog data stored in an S3 bucket.",
    "Provision an Amazon Neptune graph database for social network analysis.",
    "Set up an AWS AppSync GraphQL API for real-time data synchronization.",
    "Launch a new IoT thing to monitor temperature and humidity in a warehouse.",
    "Create a conversational chatbot using Amazon Lex for customer support inquiries.",
    "Deploy a serverless web application using AWS Amplify for hosting and authentication.",
    "Set up an Amazon Kinesis data stream to ingest and process real-time data streams.",
    "Provision an Amazon Elasticsearch Service domain for log analysis and search.",
    "Create a new Microsoft AD directory for centralized user authentication.",
    "Deploy a containerized application using Amazon ECS with Fargate launch type.",
    "Set up an Amazon Cognito user pool for managing user identities and access control."
  ],
  "Describe": [
    "Retrieve details about the hardware specifications of a specific EC2 instance.",
    "Describe the lifecycle policy and versioning configuration of an Amazon S3 bucket.",
    "Get information about the backup retention period and automatic backups of an RDS database instance.",
    "Describe the code and dependencies of a Lambda function deployed in the production environment.",
    "Retrieve details about the resource paths and methods defined in an API Gateway REST API.",
    "Describe the physical connections and bandwidth allocation of an AWS Direct Connect connection.",
    "Get information about the stages and actions defined in a CodePipeline pipeline.",
    "Describe the environment variables and runtime settings of an Elastic Beanstalk application environment.",
    "Retrieve details about the software installed and running on an EMR cluster.",
    "Describe the tables, columns, and partitions in an AWS Glue data catalog database.",
    "Get information about the storage capacity and replication settings of a Neptune database instance.",
    "Describe the resolvers and data sources defined in an AppSync GraphQL API schema.",
    "Retrieve details about the thing attributes and connectivity options of an IoT device.",
    "Describe the intents, slots, and utterances defined in a Lex chatbot.",
    "Get information about the hosting settings and domain associations of an Amplify web application.",
    "Describe the shards, retention periods, and encryption settings of a Kinesis data stream.",
    "Retrieve details about the domain endpoints and access policies of an Elasticsearch Service domain.",
    "Describe the users, groups, and permissions in a Managed Microsoft AD directory.",
    "Get information about the task definitions, services, and containers in an ECS cluster.",
    "Describe the authentication settings, user pools, and identity providers in a Cognito user pool."
  ],
  "Update": [
    "Modify the instance type and storage configuration of an existing EC2 instance.",
    "Update the access control list (ACL) and bucket policy of an S3 bucket.",
    "Change the database engine version and parameter group settings of an RDS instance.",
    "Update the code logic and dependencies of a deployed Lambda function.",
    "Modify the API Gateway endpoint settings and route configurations.",
    "Change the bandwidth and location settings of an existing Direct Connect connection.",
    "Update the source code repository and build specifications of a CodePipeline pipeline.",
    "Modify the environment settings and scaling options of an Elastic Beanstalk application.",
    "Change the instance type and number of nodes in an EMR cluster.",
    "Update the table schema and data ingestion settings of a Glue data catalog.",
    "Modify the cluster instance type and storage allocation of a Neptune database.",
    "Update the GraphQL schema, resolvers, and data sources in an AppSync API.",
    "Change the thing attributes and connectivity options of an IoT device.",
    "Modify the conversation flow, intents, and slot types of a Lex chatbot.",
    "Update the hosting configuration and deployment settings of an Amplify web application.",
    "Change the shard count and retention period of a Kinesis data stream.",
    "Modify the domain endpoints and access policies of an Elasticsearch domain.",
    "Update the user groups, permissions, and authentication settings of a Managed AD directory.",
    "Change the task definitions and container configurations of an ECS service.",
    "Modify the authentication settings, user pool policies, and identity providers of a Cognito user pool."
  ],
  "List": [
    "List all running instances in a specific Amazon EC2 region.",
    "Retrieve a list of all S3 buckets owned by the AWS account.",
    "Get a list of all RDS database instances in the account.",
    "List all Lambda functions deployed in the production environment.",
    "Retrieve a list of all API Gateway REST APIs configured in the account.",
    "Get a list of all active Direct Connect connections associated with the account.",
    "List all pipelines defined in AWS CodePipeline.",
    "Retrieve a list of all Elastic Beanstalk applications deployed in the staging environment.",
    "Get a list of all active EMR clusters running in the development VPC.",
    "List all databases cataloged in AWS Glue.",
    "Retrieve a list of all Neptune databases provisioned in the account.",
    "Get a list of all GraphQL APIs defined in AWS AppSync.",
    "List all IoT things registered in the IoT Core service.",
    "Retrieve a list of all Lex chatbots deployed in the account.",
    "Get a list of all Amplify web applications hosted in the AWS region.",
    "List all Kinesis data streams created within the last month.",
    "Retrieve a list of all Elasticsearch domains provisioned in the account.",
    "Get a list of all Managed AD directories associated with the AWS organization.",
    "List all ECS services deployed in the production ECS cluster.",
    "Retrieve a list of all Cognito user pools configured in the AWS account."
  ],
  "Delete": [
    "Terminate an EC2 instance that is no longer required.",
    "Delete an S3 bucket and all its objects to free up storage space.",
    "Remove an RDS database instance that is no longer in use.",
    "Delete a Lambda function that is no longer needed for processing.",
    "Remove an API Gateway REST API that is no longer serving traffic.",
    "Delete a Direct Connect connection that is no longer required for connectivity.",
    "Remove a CodePipeline pipeline that has been decommissioned.",
    "Delete an Elastic Beanstalk application that has reached end-of-life.",
    "Remove an EMR cluster that has completed its data processing tasks.",
    "Delete a Glue data catalog database that is obsolete.",
    "Remove a Neptune database that is no longer needed for graph operations.",
    "Delete an AppSync API that is no longer serving client applications.",
    "Remove an IoT thing that is no longer connected or functional.",
    "Delete a Lex chatbot that is no longer providing conversational support.",
    "Remove an Amplify web application that has been deprecated.",
    "Delete a Kinesis data stream that is no longer ingesting data.",
    "Remove an Elasticsearch domain that is no longer needed for log analysis.",
    "Delete a Managed AD directory that is no longer required for user authentication.",
    "Remove an ECS service that is no longer serving containerized applications.",
    "Delete a Cognito user pool that is no longer used for managing user identities."
  ]
}
