{
  "general": [
    "How do I set up a Google Cloud Platform (GCP) account?",
    "What are the main services offered by GCP?",
    "How do I create and manage billing alerts in GCP?",
    "What is Google Cloud Storage used for?",
    "How can I secure my GCP account?",
    "What are the best practices for using Google Cloud IAM?",
    "How can I monitor my GCP resources?",
    "What are GCP VM instances and how do I use them?",
    "How can I create a VPC in GCP?",
    "What support options are available in GCP?",
    "How can I set up a new Google Cloud Platform (GCP) project?",
    "What are the core services offered by Google Cloud, and how can they benefit my business?",
    "How does Google Cloud differ from other cloud providers like AWS and Azure?",
    "What options does Google Cloud provide for data storage and management?",
    "How can I ensure the security and compliance of my applications and data on Google Cloud?",
    "What tools does Google Cloud offer for monitoring and optimizing resource usage and costs?",
    "How does Google Cloud support hybrid and multi-cloud architectures?",
    "What are the best practices for deploying and managing applications on Google Cloud?",
    "How can I integrate Google Cloud services with my existing infrastructure and tools?",
    "What support options are available for businesses using Google Cloud, and how can I access them?"
  ],
  "create": [
    "Create a Cloud Storage bucket to store files",
    "Launch a basic Compute Engine instance",
    "Set up a new IAM user with basic permissions",
    "Create a new VPC with a public subnet",
    "Set up a basic Cloud SQL instance",
    "Create a Firestore database with default settings",
    "Deploy a simple Cloud Function",
    "Create a Pub/Sub topic for messaging",
    "Set up a Cloud Monitoring alert",
    "Create a Deployment Manager configuration",
    "Launch a virtual machine instance (VM) in Google Compute Engine (GCE) with specific configurations and operating system",
    "Deploy a containerized application to Google Kubernetes Engine (GKE) for scalable container orchestration",
    "Create a Cloud Storage bucket to store and manage objects with specified access controls and storage class",
    "Set up a Cloud SQL instance for hosting relational databases with high availability and automated backups",
    "Configure Cloud Pub/Sub for asynchronous messaging between distributed applications",
    "Implement Cloud Functions to run serverless code in response to events triggered by HTTP requests or other services",
    "Create and configure a Virtual Private Cloud (VPC) network with subnets, firewall rules, and routing policies",
    "Set up Cloud CDN to deliver content to users with lower latency and improved performance",
    "Create a Cloud Spanner database for globally consistent, scalable, and highly available relational data storage",
    "Deploy a Cloud Dataflow pipeline for real-time stream and batch data processing",
    "Use BigQuery to create datasets and tables for analyzing large datasets with SQL queries",
    "Implement Cloud Dataproc to create managed Apache Spark and Hadoop clusters for big data processing",
    "Configure Cloud Armor to protect applications from DDoS attacks and manage access control with a web application firewall (WAF)",
    "Deploy an AI Platform model for machine learning predictions and inference",
    "Set up Cloud DNS to manage domain names and route traffic to GCP resources"
  ],
  "describe": [
    "Describe the details of a Compute Engine instance",
    "List the contents of a Cloud Storage bucket",
    "Get information about a Cloud SQL instance",
    "Describe the configuration of a Cloud Function",
    "Get details about a Firestore database",
    "Describe a Pub/Sub topic",
    "List the metrics of a Cloud Monitoring alert",
    "Describe a Deployment Manager configuration",
    "Get details of a VPC",
    "Describe the policies of an IAM user",
    "Get details about a VM instance in Google Compute Engine, including machine type, zone, and attached disks",
    "Describe the objects stored in a Cloud Storage bucket, including metadata and access control settings",
    "Retrieve information about a Cloud SQL instance, including database version, storage capacity, and connection details",
    "Get details about a Kubernetes cluster in Google Kubernetes Engine, including node configurations, deployed services, and namespaces",
    "Describe the settings and code of a Cloud Function, including triggers, runtime, and execution time",
    "Retrieve information about a Cloud Pub/Sub topic, including message retention duration and subscription details",
    "Describe the schema, throughput, and indexes of a Firestore database",
    "Get details about a BigQuery dataset, including tables, views, and data schema",
    "Describe the configuration of a VPC network, including subnets, firewall rules, and peering connections",
    "Retrieve information about a Cloud Spanner instance, including node count, region, and database schemas"
  ],
  "update": [
    "Resize a Compute Engine instance",
    "Update the permissions of an IAM user",
    "Modify the instance type of a Cloud SQL instance",
    "Update the code of a Cloud Function",
    "Adjust the throughput of a Firestore database",
    "Update the configuration of a Cloud Monitoring alert",
    "Modify the properties of a Deployment Manager configuration",
    "Update the settings of a Pub/Sub topic",
    "Change the CIDR block of a VPC",
    "Update the lifecycle policy of a Cloud Storage bucket",
    "Modify the machine type or configuration of an existing VM instance in Google Compute Engine, such as increase the number of CPU cores or amount of memory",
    "Update the container image or configuration of a service running in Google Kubernetes Engine",
    "Change the access control settings or storage class of objects in a Cloud Storage bucket",
    "Scale up the storage capacity or change the database version of a Cloud SQL instance",
    "Modify the trigger conditions or code of an existing Cloud Function",
    "Update the retention duration or access control of a Cloud Pub/Sub topic",
    "Modify the schema or indexes of a Firestore database",
    "Change the schema or permissions of tables within a BigQuery dataset",
    "Update firewall rules, routing policies, or VPN configurations of a VPC network",
    "Increase the storage capacity or adjust the number of nodes in a Cloud Spanner instance"
  ],
  "list": [
    "List all Compute Engine instances in a region",
    "List all Cloud Storage buckets in an account",
    "List all IAM users",
    "List all Cloud SQL instances in a region",
    "List all Firestore databases in an account",
    "List all Cloud Functions in a region",
    "List all Pub/Sub topics in an account",
    "List all Deployment Manager configurations",
    "List all VPCs in a region",
    "List all Cloud Monitoring alerts in an account",
    "List all VM instances in a specific zone or across all zones in Google Compute Engine",
    "List all objects within a Cloud Storage bucket, including subfolders and nested objects",
    "List all Cloud SQL instances within a project, including their configuration and status",
    "List all Kubernetes clusters in Google Kubernetes Engine, along with their node pools and versions",
    "List all Cloud Functions within a project, including their trigger types and source code locations",
    "List all Cloud Pub/Sub topics and subscriptions within a project",
    "List all Firestore databases within a project, including their schemas and indexes",
    "List all BigQuery datasets within a project, along with their tables and views",
    "List all VPC networks within a project, including subnets, firewall rules, and routes",
    "List all Cloud Spanner instances within a project, including their regions and database configurations"
  ],
  "delete": [
    "Delete a Compute Engine instance",
    "Delete a Cloud Storage bucket and its contents",
    "Remove an IAM user",
    "Delete a Cloud SQL instance",
    "Remove a Firestore database",
    "Delete a Cloud Function",
    "Remove a Pub/Sub topic",
    "Delete a Deployment Manager configuration",
    "Delete a VPC",
    "Remove a Cloud Monitoring alert",
    "Delete a VM instance in Google Compute Engine and remove all associated disks and configurations",
    "Delete a Cloud Storage bucket and permanently remove all objects stored within it",
    "Delete a Cloud SQL instance and remove all associated databases and backups",
    "Remove a Cloud Function and delete its code and configuration",
    "Delete a Kubernetes cluster in Google Kubernetes Engine and remove all deployed workloads and configurations",
    "Delete a Cloud Pub/Sub topic and remove all associated subscriptions and messages",
    "Delete a Firestore database and remove all collections and documents stored within it",
    "Delete a BigQuery dataset and remove all tables and data stored within it",
    "Remove a VPC network and delete all associated subnets, firewall rules, and configurations",
    "Delete a Cloud Spanner instance and remove all associated databases and data"
  ]
}
