{
  "General": [
    "How can I set up a new Google Cloud Platform (GCP) project?",
    "What are the core services offered by Google Cloud, and how can they benefit my business?",
    "How does Google Cloud differ from other cloud providers like AWS and Azure?",
    "What options does Google Cloud provide for data storage and management?",
    "How can I ensure the security and compliance of my applications and data on Google Cloud?",
    "What tools does Google Cloud offer for monitoring and optimizing resource usage and costs?",
    "How does Google Cloud support hybrid and multi-cloud architectures?",
    "What are the best practices for deploying and managing applications on Google Cloud?",
    "How can I integrate Google Cloud services with my existing infrastructure and tools?",
    "What support options are available for businesses using Google Cloud, and how can I access them?"
  ],
  "Describe": [
    "Get details about a VM instance in Google Compute Engine, including machine type, zone, and attached disks.",
    "Describe the objects stored in a Cloud Storage bucket, including metadata and access control settings.",
    "Retrieve information about a Cloud SQL instance, including database version, storage capacity, and connection details.",
    "Get details about a Kubernetes cluster in Google Kubernetes Engine, including node configurations, deployed services, and namespaces.",
    "Describe the settings and code of a Cloud Function, including triggers, runtime, and execution time.",
    "Retrieve information about a Cloud Pub/Sub topic, including message retention duration and subscription details.",
    "Describe the schema, throughput, and indexes of a Firestore database.",
    "Get details about a BigQuery dataset, including tables, views, and data schema.",
    "Describe the configuration of a VPC network, including subnets, firewall rules, and peering connections.",
    "Retrieve information about a Cloud Spanner instance, including node count, region, and database schemas."
  ],
  "Update": [
    "Modify the machine type or configuration of an existing VM instance in Google Compute Engine, such as adding more CPUs or memory.",
    "Update the access control policies of a Cloud Storage bucket to grant or revoke permissions for users or applications.",
    "Adjust the settings of a Cloud SQL instance, such as changing the instance size or modifying the backup schedule.",
    "Update the code or configuration of a Cloud Function to add new features or improve performance.",
    "Modify the node pool size or autoscaling settings of a Kubernetes cluster in Google Kubernetes Engine.",
    "Adjust the retention policy or subscription settings of a Cloud Pub/Sub topic.",
    "Update the throughput or indexing configuration of a Firestore database.",
    "Modify the schema or partitioning settings of a BigQuery table.",
    "Update the firewall rules or subnet configurations in a VPC network.",
    "Adjust the replication or node count settings of a Cloud Spanner instance."
  ],
  "List": [
    "List all VM instances in a specific Google Cloud project along with their machine types, zones, and statuses.",
    "Retrieve a list of Cloud Storage buckets in a Google Cloud project along with their creation dates and storage classes.",
    "List all Cloud SQL instances in a project along with their database versions, regions, and statuses.",
    "Get a list of deployed Cloud Functions in a project along with their names, runtimes, and trigger types.",
    "List all Kubernetes clusters in Google Kubernetes Engine along with their node counts, versions, and statuses.",
    "Retrieve a list of Cloud Pub/Sub topics in a project along with their subscription counts and message retention settings.",
    "List all Firestore databases in a project along with their collection names, document counts, and indexes.",
    "Get a list of BigQuery datasets in a project along with their table names, schema details, and data sizes.",
    "List all VPC networks in a project along with their subnets, firewall rules, and peering connections.",
    "Retrieve a list of Cloud Spanner instances in a project along with their node counts, regions, and database schemas."
  ],
  "Delete": [
    "Delete a VM instance in Google Compute Engine and remove all associated disks and configurations.",
    "Delete a Cloud Storage bucket and permanently remove all objects stored within it.",
    "Delete a Cloud SQL instance and remove all associated databases and backups.",
    "Remove a Cloud Function and delete its code and configuration.",
    "Delete a Kubernetes cluster in Google Kubernetes Engine and remove all deployed workloads and configurations.",
    "Delete a Cloud Pub/Sub topic and remove all associated subscriptions and messages.",
    "Delete a Firestore database and remove all collections and documents stored within it.",
    "Delete a BigQuery dataset and remove all tables and data stored within it.",
    "Remove a VPC network and delete all associated subnets, firewall rules, and configurations.",
    "Delete a Cloud Spanner instance and remove all associated databases and data."
  ]
}
