{
"aws": {
  "general": [
    "What is AWS and what are its primary services?",
    "How do I create and manage billing alerts in AWS?",
    "What is Amazon S3 used for?",
    "How can I secure my AWS account?",
    "What are the best practices for using AWS IAM?",
    "How can I monitor my AWS usage?",
    "What are EC2 instances and how do I use them?",
    "How can I create a VPC in AWS?",
    "How can I migrate my existing applications to AWS?",
    "What is the AWS Free Tier, and how can I use it to get started with AWS services?",
    "How can I set up billing alerts in AWS to monitor my usage and costs",
    "What AWS services can I use for machine learning and artificial intelligence",
    "How do I configure IAM policies to control access to AWS resources",
    "What are the best practices for securing my EC2 instances in AWS",
    "How can I optimize the performance of my RDS databases in AWS",
    "What AWS services support serverless computing",
    "How do I enable logging and monitoring for my AWS resources",
    "What AWS services can I use for data analytics and visualization",
    "How do I configure auto-scaling for my applications in AWS",
    "What are the options for disaster recovery and backup in AWS"
  ],
  "create": [
      "Create an S3 bucket to store files",
      "Launch a basic EC2 instance",
      "Set up a new IAM user with basic permissions",
      "Create a new VPC with a public subnet",
      "Set up a basic RDS instance",
      "Create a DynamoDB table with default settings",
      "Deploy a simple Lambda function",
      "Create an SNS topic for notifications",
      "Set up a CloudWatch alarm for monitoring",
      "Create a CloudFormation stack with a sample template",
      "Launch an EC2 instance in a specific region with predefined configurations",
      "Create an S3 bucket to store and manage objects",
      "Set up an RDS database instance for hosting relational databases",
      "Deploy a Lambda function to execute serverless code in response to events",
      "Create a DynamoDB table for scalable, NoSQL database storage",
      "Provision an ECS cluster to run containerized applications",
      "Set up an API Gateway for building and managing APIs",
      "Create a CloudFormation stack to provision AWS resources using templates",
      "Deploy a Redshift cluster for data warehousing and analytics",
      "Create a VPC with subnets, route tables, and internet gateways"

  ],
  "describe": [
      "Describe the details of an EC2 instance",
      "List the contents of an S3 bucket",
      "Get information about an RDS instance",
      "Describe the configuration of a Lambda function",
      "Get details about a DynamoDB table",
      "Describe an SNS topic",
      "List the metrics of a CloudWatch alarm",
      "Describe a CloudFormation stack",
      "Get details of a VPC",
      "Describe the policies of an IAM user",
      "Describe the configuration details of an EC2 instance, including instance type, security groups, and tags",
      "List the objects stored in an S3 bucket along with their metadata",
      "Retrieve information about the databases hosted on an RDS instance, including engine type, size, and status",
      "Get details about a Lambda function, including function code, runtime, and trigger configuration",
      "Describe the schema and provisioned throughput of a DynamoDB table",
      "Retrieve information about tasks running in an ECS cluster, including task definitions and container instances",
      "Describe the resources configured in an API Gateway, including endpoints, methods, and integrations",
      "List the resources provisioned by a CloudFormation stack, including EC2 instances, S3 buckets, and IAM roles",
      "Retrieve metadata about tables stored in a Redshift cluster, including distribution style and sort keys",
      "Describe the networking configuration of a VPC, including subnets, route tables, and network ACLs"
  ],
  "update": [
      "Change the instance type of an EC2 instance",
      "Update the permissions of an IAM user",
      "Modify the storage size of an RDS instance",
      "Update the code of a Lambda function",
      "Adjust the provisioned throughput of a DynamoDB table",
      "Update the configuration of a CloudWatch alarm",
      "Modify the properties of a CloudFormation stack",
      "Update the settings of an SNS topic",
      "Change the CIDR block of a VPC",
      "Update the lifecycle policy of an S3 bucket",
      "Modify the configuration of an existing EC2 instance, such as changing instance type or adding/removing security groups",
      "Update the access permissions of an S3 bucket to grant or revoke access to specific users or applications",
      "Modify the parameters of an RDS database instance, such as increasing storage capacity or changing the backup retention period",
      "Update the code or configuration of a Lambda function to add new functionality or improve performance",
      "Adjust the provisioned throughput or capacity settings of a DynamoDB table to accommodate changes in workload",
      "Update the task definition or deployment configuration of a task running in an ECS cluster",
      "Modify the API configuration in API Gateway to add new endpoints, methods, or integrations",
      "Update the resources provisioned by a CloudFormation stack by modifying the template or parameter values",
      "Adjust the configuration settings of a Redshift cluster, such as enabling encryption or changing the node type",
      "Update the networking configuration of a VPC, such as adding or removing subnets or modifying route table entries"
  ],
  "list": [
      "List all EC2 instances in a region",
      "List all S3 buckets in an account",
      "List all IAM users",
      "List all RDS instances in a region",
      "List all DynamoDB tables in an account",
      "List all Lambda functions in a region",
      "List all SNS topics in an account",
      "List all CloudFormation stacks",
      "List all VPCs in a region",
      "List all CloudWatch alarms in an account",
      "List all EC2 instances in a specific region along with their instance IDs, instance types, and current status",
      "Retrieve a list of S3 buckets owned by the AWS account along with their creation dates and storage usage",
      "List all RDS database instances in a region along with their engine types, sizes, and status",
      "Get a list of Lambda functions deployed in the AWS account along with their function names and runtimes",
      "List all DynamoDB tables in the AWS account along with their table names, provisioned throughput, and storage size",
      "Retrieve a list of ECS clusters in a region along with their cluster names and current status",
      "List all API configurations in API Gateway along with their API names, endpoints, and deployment stages",
      "Get a list of CloudFormation stacks in the AWS account along with their stack names, status, and creation times",
      "Retrieve a list of Redshift clusters in a region along with their cluster names, node types, and status",
      "List all VPCs in the AWS account along with their VPC IDs, CIDR blocks, and associated subnets"
  ],
  "delete": [
      "Terminate an EC2 instance",
      "Delete an S3 bucket and its contents",
      "Remove an IAM user",
      "Delete an RDS instance",
      "Remove a DynamoDB table",
      "Delete a Lambda function",
      "Remove an SNS topic",
      "Delete a CloudFormation stack",
      "Delete a VPC",
      "Remove a CloudWatch alarm",
      "Terminate an EC2 instance and remove it from the AWS account",
      "Delete an S3 bucket and permanently remove all objects stored in it",
      "Delete an RDS database instance and remove all associated snapshots and backups",
      "Remove a Lambda function and delete its code and configuration",
      "Delete a DynamoDB table and remove all data stored in it",
      "Delete an ECS cluster and remove all tasks and services associated with it",
      "Remove an API configuration from API Gateway and delete all associated resources",
      "Delete a CloudFormation stack and remove all provisioned resources",
      "Delete a Redshift cluster and remove all associated databases and data",
      "Remove a VPC and delete all associated subnets, route tables, and network ACLs"
  ]
},
"azure": {
  "general": [
      "How do I create a new Azure subscription?",
      "What services does Azure offer?",
      "How can I set up billing alerts in Azure?",
      "What is Azure Blob Storage used for?",
      "How can I secure my Azure account?",
      "What are the best practices for using Azure AD?",
      "How can I monitor my Azure resources?",
      "What are Azure VMs and how do I use them?",
      "How can I create a virtual network in Azure?",
      "What support options are available in Azure?",
      "How do I create a new Azure subscription",
      "What Azure services are available for hosting web applications",
      "How can I set up network security groups to control traffic to my Azure resources",
      "What options does Azure offer for identity and access management",
      "How do I monitor the performance and health of my Azure resources",
      "What are the best practices for implementing high availability in Azure",
      "How can I integrate Azure services with on-premises infrastructure",
      "What tools does Azure provide for data analytics and machine learning",
      "How do I automate resource provisioning and management in Azure",
      "What are the options for disaster recovery and backup in Azure"
  ],
  "create": [
      "Create an Azure Blob Storage container",
      "Launch a basic Azure VM",
      "Set up a new Azure AD user with basic permissions",
      "Create a new virtual network with a public subnet",
      "Set up a basic Azure SQL Database",
      "Create a Cosmos DB database with default settings",
      "Deploy a simple Azure Function",
      "Create a Service Bus topic for messaging",
      "Set up an Azure Monitor alert",
      "Create an Azure Resource Manager (ARM) template deployment",
      "Provision a virtual machine (VM) in Azure with specific configurations and operating system",
      "Create a storage account in Azure to store files, blobs, and other data objects",
      "Deploy a web app in Azure App Service with custom code or from a container image",
      "Set up a SQL database in Azure to store relational data with scalability and built-in security",
      "Create a virtual network (VNet) in Azure with subnets, network security groups, and routing rules",
      "Deploy a Kubernetes cluster in Azure Kubernetes Service (AKS) for container orchestration",
      "Set up an Azure Functions app to execute serverless code in response to events",
      "Create a Cosmos DB instance in Azure for globally distributed NoSQL databases",
      "Provision an Azure Active Directory (AD) tenant and configure user accounts and access policies",
      "Set up an Azure DevOps project for continuous integration and delivery (CI/CD) pipelines"
  ],
  "describe": [
      "Describe the details of an Azure VM",
      "List the contents of a Blob Storage container",
      "Get information about an Azure SQL Database",
      "Describe the configuration of an Azure Function",
      "Get details about a Cosmos DB database",
      "Describe a Service Bus topic",
      "List the metrics of an Azure Monitor alert",
      "Describe an ARM template deployment",
      "Get details of a virtual network",
      "Describe the policies of an Azure AD user",
      "Get details about a specific VM in Azure, including its size, operating system, and resource group",
      "Describe the contents of a storage account in Azure, including blobs, files, and containers",
      "Retrieve information about a web app deployed in Azure App Service, including its URL, deployment slots, and scaling settings",
      "Get metadata about a SQL database in Azure, including its size, performance tiers, and backup schedule",
      "Describe the networking configuration of a VNet in Azure, including subnets, virtual network peering, and firewall rules",
      "Retrieve information about a Kubernetes cluster in AKS, including node count, version, and deployed workloads",
      "Describe the settings and triggers configured for an Azure Functions app, including function code and bindings",
      "Get details about a Cosmos DB instance in Azure, including its consistency level, throughput, and geographical replication",
      "Describe the users and groups configured in an Azure AD tenant, including their roles and permissions",
      "Retrieve information about Azure DevOps projects, including repositories, pipelines, and work items"
  ],
  "update": [
      "Resize an Azure VM",
      "Update the permissions of an Azure AD user",
      "Modify the performance tier of an Azure SQL Database",
      "Update the code of an Azure Function",
      "Adjust the throughput of a Cosmos DB database",
      "Update the configuration of an Azure Monitor alert",
      "Modify the properties of an",
      "Update the settings of a Service Bus topic",
      "Change the address space of a virtual network",
      "Update the access policy of a Blob Storage container",
      "Resize or change the configuration of an existing VM in Azure, such as increasing memory or adding additional disks",
      "Update the access control settings of a storage account in Azure to grant or revoke permissions to specific users or applications",
      "Modify the deployment settings of a web app in Azure App Service, such as updating the runtime stack or deployment slots",
      "Adjust the performance tier or scaling settings of a SQL database in Azure to accommodate changes in workload",
      "Update the networking configuration of a VNet in Azure, such as adding or removing subnets or updating routing rules",
      "Modify the node count or scaling settings of a Kubernetes cluster in AKS to adjust capacity based on demand",
      "Update the code or configuration of an Azure Functions app to add new functionality or improve performance",
      "Adjust the throughput or consistency level settings of a Cosmos DB instance in Azure to optimize performance",
      "Modify user accounts, groups, or access policies in an Azure AD tenant to reflect changes in organizational structure or requirements",
      "Update the configuration of Azure DevOps projects, such as adding new repositories or modifying pipeline definitions"
  ],
  "list": [
      "List all Azure VMs in a region",
      "List all Blob Storage containers in an account",
      "List all Azure AD users",
      "List all Azure SQL Databases in a region",
      "List all Cosmos DB databases in an account",
      "List all Azure Functions in a region",
      "List all Service Bus topics in an account",
      "List all ARM template deployments",
      "List all virtual networks in a region",
      "List all Azure Monitor alerts in an account",
      "List all VMs deployed in a specific Azure subscription along with their names, sizes, and resource groups",
      "Retrieve a list of storage accounts in Azure along with their types, locations, and creation dates",
      "List all web apps deployed in Azure App Service along with their URLs, runtime stacks, and deployment slots",
      "Get a list of SQL databases in Azure along with their names, performance tiers, and backup status",
      "List all VNets in Azure along with their names, address spaces, and associated subnets",
      "Retrieve a list of Kubernetes clusters in AKS along with their names, versions, and node counts",
      "List all Azure Functions apps along with their names, triggers, and function counts",
      "Get a list of Cosmos DB instances in Azure along with their names, consistency levels, and throughput settings",
      "List all users and groups in an Azure AD tenant along with their roles, memberships, and permissions",
      "Retrieve a list of Azure DevOps projects along with their names, repositories, pipelines, and build statuses"
  ],
  "delete": [
      "Delete an Azure VM",
      "Delete a Blob Storage container and its contents",
      "Remove an Azure AD user",
      "Delete an Azure SQL Database",
      "Remove a Cosmos DB database",
      "Delete an Azure Function",
      "Remove a Service Bus topic",
      "Delete an ARM template deployment",
      "Delete a virtual network",
      "Remove an Azure Monitor alert",
      "Delete a VM in Azure and remove all associated disks, network interfaces, and configurations",
      "Remove a storage account in Azure and permanently delete all blobs, files, and containers stored within it",
      "Delete a web app in Azure App Service and remove all associated deployment slots, configurations, and certificates",
      "Remove a SQL database in Azure and permanently delete all data stored within it, along with associated backups and replicas",
      "Delete a VNet in Azure and remove all associated subnets, peering connections, and network security groups",
      "Remove a Kubernetes cluster in AKS and delete all deployed workloads, pods, and configurations",
      "Delete an Azure Functions app and remove all associated function code, triggers, and bindings",
      "Remove a Cosmos DB instance in Azure and permanently delete all data stored within it, along with associated backups and replicas",
      "Delete user accounts or groups in an Azure AD tenant and remove all associated permissions and access policies",
      "Delete an Azure DevOps project and remove all associated repositories, pipelines, and build artifacts"
  ]
},
"gcp": {
  "general": [
    "How do I set up a Google Cloud Platform (GCP) account?",
    "What are the main services offered by GCP?",
    "How do I create and manage billing alerts in GCP?",
    "What is Google Cloud Storage used for?",
    "How can I secure my GCP account?",
    "What are the best practices for using Google Cloud IAM?",
    "How can I monitor my GCP resources?",
    "What are GCP VM instances and how do I use them?",
    "How can I create a VPC in GCP?",
    "What support options are available in GCP?",
    "How can I set up a new Google Cloud Platform (GCP) project?",
    "What are the core services offered by Google Cloud, and how can they benefit my business?",
    "How does Google Cloud differ from other cloud providers like AWS and Azure?",
    "What options does Google Cloud provide for data storage and management?",
    "How can I ensure the security and compliance of my applications and data on Google Cloud?",
    "What tools does Google Cloud offer for monitoring and optimizing resource usage and costs?",
    "How does Google Cloud support hybrid and multi-cloud architectures?",
    "What are the best practices for deploying and managing applications on Google Cloud?",
    "How can I integrate Google Cloud services with my existing infrastructure and tools?",
    "What support options are available for businesses using Google Cloud, and how can I access them?"
  ],
  "create": [
    "Create a Cloud Storage bucket to store files",
    "Launch a basic Compute Engine instance",
    "Set up a new IAM user with basic permissions",
    "Create a new VPC with a public subnet",
    "Set up a basic Cloud SQL instance",
    "Create a Firestore database with default settings",
    "Deploy a simple Cloud Function",
    "Create a Pub/Sub topic for messaging",
    "Set up a Cloud Monitoring alert",
    "Create a Deployment Manager configuration",
    "Launch a virtual machine instance (VM) in Google Compute Engine (GCE) with specific configurations and operating system",
    "Deploy a containerized application to Google Kubernetes Engine (GKE) for scalable container orchestration",
    "Create a Cloud Storage bucket to store and manage objects with specified access controls and storage class",
    "Set up a Cloud SQL instance for hosting relational databases with high availability and automated backups",
    "Configure Cloud Pub/Sub for asynchronous messaging between distributed applications",
    "Implement Cloud Functions to run serverless code in response to events triggered by HTTP requests or other services",
    "Create and configure a Virtual Private Cloud (VPC) network with subnets, firewall rules, and routing policies",
    "Set up Cloud CDN to deliver content to users with lower latency and improved performance",
    "Create a Cloud Spanner database for globally consistent, scalable, and highly available relational data storage",
    "Deploy a Cloud Dataflow pipeline for real-time stream and batch data processing",
    "Use BigQuery to create datasets and tables for analyzing large datasets with SQL queries",
    "Implement Cloud Dataproc to create managed Apache Spark and Hadoop clusters for big data processing",
    "Configure Cloud Armor to protect applications from DDoS attacks and manage access control with a web application firewall (WAF)",
    "Deploy an AI Platform model for machine learning predictions and inference",
    "Set up Cloud DNS to manage domain names and route traffic to GCP resources"
  ],
  "describe": [
    "Describe the details of a Compute Engine instance",
    "List the contents of a Cloud Storage bucket",
    "Get information about a Cloud SQL instance",
    "Describe the configuration of a Cloud Function",
    "Get details about a Firestore database",
    "Describe a Pub/Sub topic",
    "List the metrics of a Cloud Monitoring alert",
    "Describe a Deployment Manager configuration",
    "Get details of a VPC",
    "Describe the policies of an IAM user",
    "Get details about a VM instance in Google Compute Engine, including machine type, zone, and attached disks",
    "Describe the objects stored in a Cloud Storage bucket, including metadata and access control settings",
    "Retrieve information about a Cloud SQL instance, including database version, storage capacity, and connection details",
    "Get details about a Kubernetes cluster in Google Kubernetes Engine, including node configurations, deployed services, and namespaces",
    "Describe the settings and code of a Cloud Function, including triggers, runtime, and execution time",
    "Retrieve information about a Cloud Pub/Sub topic, including message retention duration and subscription details",
    "Describe the schema, throughput, and indexes of a Firestore database",
    "Get details about a BigQuery dataset, including tables, views, and data schema",
    "Describe the configuration of a VPC network, including subnets, firewall rules, and peering connections",
    "Retrieve information about a Cloud Spanner instance, including node count, region, and database schemas"
  ],
  "update": [
    "Resize a Compute Engine instance",
    "Update the permissions of an IAM user",
    "Modify the instance type of a Cloud SQL instance",
    "Update the code of a Cloud Function",
    "Adjust the throughput of a Firestore database",
    "Update the configuration of a Cloud Monitoring alert",
    "Modify the properties of a Deployment Manager configuration",
    "Update the settings of a Pub/Sub topic",
    "Change the CIDR block of a VPC",
    "Update the lifecycle policy of a Cloud Storage bucket",
    "Modify the machine type or configuration of an existing VM instance in Google Compute Engine, such as increase the number of CPU cores or amount of memory",
    "Update the container image or configuration of a service running in Google Kubernetes Engine",
    "Change the access control settings or storage class of objects in a Cloud Storage bucket",
    "Scale up the storage capacity or change the database version of a Cloud SQL instance",
    "Modify the trigger conditions or code of an existing Cloud Function",
    "Update the retention duration or access control of a Cloud Pub/Sub topic",
    "Modify the schema or indexes of a Firestore database",
    "Change the schema or permissions of tables within a BigQuery dataset",
    "Update firewall rules, routing policies, or VPN configurations of a VPC network",
    "Increase the storage capacity or adjust the number of nodes in a Cloud Spanner instance"
  ],
  "list": [
    "List all Compute Engine instances in a region",
    "List all Cloud Storage buckets in an account",
    "List all IAM users",
    "List all Cloud SQL instances in a region",
    "List all Firestore databases in an account",
    "List all Cloud Functions in a region",
    "List all Pub/Sub topics in an account",
    "List all Deployment Manager configurations",
    "List all VPCs in a region",
    "List all Cloud Monitoring alerts in an account",
    "List all VM instances in a specific zone or across all zones in Google Compute Engine",
    "List all objects within a Cloud Storage bucket, including subfolders and nested objects",
    "List all Cloud SQL instances within a project, including their configuration and status",
    "List all Kubernetes clusters in Google Kubernetes Engine, along with their node pools and versions",
    "List all Cloud Functions within a project, including their trigger types and source code locations",
    "List all Cloud Pub/Sub topics and subscriptions within a project",
    "List all Firestore databases within a project, including their schemas and indexes",
    "List all BigQuery datasets within a project, along with their tables and views",
    "List all VPC networks within a project, including subnets, firewall rules, and routes",
    "List all Cloud Spanner instances within a project, including their regions and database configurations"
  ],
  "delete": [
    "Delete a Compute Engine instance",
    "Delete a Cloud Storage bucket and its contents",
    "Remove an IAM user",
    "Delete a Cloud SQL instance",
    "Remove a Firestore database",
    "Delete a Cloud Function",
    "Remove a Pub/Sub topic",
    "Delete a Deployment Manager configuration",
    "Delete a VPC",
    "Remove a Cloud Monitoring alert",
    "Delete a VM instance in Google Compute Engine and remove all associated disks and configurations",
    "Delete a Cloud Storage bucket and permanently remove all objects stored within it",
    "Delete a Cloud SQL instance and remove all associated databases and backups",
    "Remove a Cloud Function and delete its code and configuration",
    "Delete a Kubernetes cluster in Google Kubernetes Engine and remove all deployed workloads and configurations",
    "Delete a Cloud Pub/Sub topic and remove all associated subscriptions and messages",
    "Delete a Firestore database and remove all collections and documents stored within it",
    "Delete a BigQuery dataset and remove all tables and data stored within it",
    "Remove a VPC network and delete all associated subnets, firewall rules, and configurations",
    "Delete a Cloud Spanner instance and remove all associated databases and data"
  ]
}
}

