[
  {},
  {},
  {
    "image": "cloudEngineer",
    "description": "Your digital assistant for seamless cloud management; assign tasks & get them delivered promptly.",
    "title": "AI Cloud Engineer\n (Digital Edition)"
  },
  {
    "image": "webPortal",
    "description": "Your intuitive hub for seamless cloud automation, management, and everything.",
    "title": "Smart Web Portal"
  },
  {
    "image": "naturalLanguage",
    "description": "Interact with the cloud platform using natural language commands, making it intuitive and user-friendly.",
    "title": "Natural Language\n Interface"
  },
  {
    "image": "universalSearch",
    "description": "Instantly access comprehensive details of your cloud ecosystem, resources, and predefined fields. This feature would greatly supplement your cloud operations. Enjoy quick and intuitive navigation for enhanced productivity.",
    "title": "Universal Search Bar"
  },
  {
    "image": "einsteinCloud",
    "description": "Meet Einstein, a super-intelligent framework we have built to handle special and complex requirements with unparalleled efficiency and intelligence.",
    "title": "Einstein : Your Genius\n Cloud Champion"
  },
  {
    "image": "multiCloud",
    "description": "Harness the power of multiple cloud providers with ease. HIAIDO seamlessly integrates with AWS, Azure, and GCP, enabling you to manage resources across different clouds effortlessly.",
    "title": "Multi Cloud Integration"
  },
  {
    "image": "jiraIntegration",
    "description": "Harness the power of multiple cloud providers with ease. HIAIDO seamlessly integrates with AWS, Azure, and GCP, enabling you to manage resources across different clouds effortlessly.",
    "title": "JIRA Integration"
  },
  {
    "image": "alerts",
    "description": "Stay informed with actionable alerts that provide instant notifications when critical events occur in your cloud environment. Our intelligent alerts empower you to proactively address issues before they impact your users, ensuring seamless operations.",
    "title": "Alerts"
  },
  {
    "image": "sandhAi",
    "description": "Sandhai is Hiaido's marketplace to access a diverse array of specialized AI agents tailored to your unique requirements. Whether you need assistance with specific tasks or seek expertise in niche areas, our marketplace offers. Purpose-built AI agents available for hire or rent. Unlock the power of AI tailored to your needs, effortlessly.",
    "title": "Sandh.ai"
  },
  {
    "image": "sandhAi",
    "description": "Explore the world of serverless development with our interactive playground. This feature provides a sandbox environment where developers can experiment with serverless functions effortlessly. Say goodbye to infrastructure setup headaches and hello to playful experimentation.",
    "title": "Serverless Functions\n Playground"
  },
  {
    "image": "sandhAi",
    "description": "Stop wasting time on manual security tasks. Hiaido, the world's first AI-powered cloud automation platform, automates security configurations and compliance checks, freeing you to focus on innovation.",
    "title": "Security. Automated"
  },
  {
    "image": "sandhAi",
    "description": "Unlock the full potential of your cloud environment with personalized recommendations tailored to your specific usage patterns and business needs. Our AI-driven recommendation engine analyzes your cloud usage data and provides actionable insights to optimize performance, reduce costs, and enhance security.",
    "title": "Recommendations Engine"
  },
  {
    "image": "devOpsSuite",
    "description": "Unlock the full potential of your cloud environment with personalized recommendations tailored to your specific usage patterns and business needs. Our AI-driven recommendation engine analyzes your cloud usage data and provides actionable insights to optimize performance, reduce costs, and enhance security. ",
    "title": "SKY HIAIDO's\n DevOps Suite"
  },
  {
    "image": "sandhAi",
    "description": "Elevate security and trust with our blockchain-powered security ledger. Maintain an immutable record of all access attempts and resource modifications, ensuring transparency and accountability within your cloud environment. Trust the ledger to safeguard your data and uphold integrity.",
    "title": "Blockchain-based\n Security Ledger"
  },
  {
    "image": "sandhAi",
    "description": "Proactively stress test your cloud infrastructure with integrated chaos engineering tools. This feature simulates disruptions and failures, allowing you to identify and address potential weak points before they impact your users. Embrace the chaos and fortify your cloud environment for resilience.",
    "title": "Chaos Engineering\n Integration"
  },
  {
    "image": "sandhAi",
    "description": "Maximize cost efficiency and optimize your cloud spending with Hiaido's Cost Optimization feature. Leverage AI-driven insights and recommendations to identify cost-saving opportunities, eliminate waste, and optimize resource utilization across your cloud environment.",
    "title": "Cost Optimisation"
  },
  {
    "image": "sandhAi",
    "description": "Stay compliant with industry regulations such as GDPR, HIPAA, PCI DSS, and more with Hiaido's Compliance Management pack. Seamlessly integrate with leading compliance frameworks and automate compliance checks to ensure adherence to regulatory requirements and security standards.",
    "title": "Compliance\n Management Pack"
  },
  {
    "image": "sandhAi",
    "description": "Get a comprehensive view of your entire cloud environment with Hiaido's Unified Dashboard feature. Consolidate metrics from multiple cloud platforms into a single, intuitive interface, allowing you to monitor performance, track costs, and manage resources effectively. With real-time insights and customizable dashboards, Hiaido's Unified Dashboard enables you to make informed decisions and optimize your cloud operations with ease.",
    "title": "Unified Dashboard"
  },
  {
    "image": "sandhAi",
    "description": "Streamline your development process and ensure code quality with Hiaido's Automated Code Review & Optimization feature. Automatically analyze your codebase for best practices, security vulnerabilities, and performance optimizations, helping you deliver high-quality applications faster. With intelligent recommendations and automated fixes, Hiaido empowers your development team to write better code and improve application reliability without manual intervention.",
    "title": "Code Review &\n Optimization. Automated."
  }
]
